newwms_gift/src/InformationRegisters/итWMSДиапазоныSSCC/итWMSДиапазоныSSCC.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSДиапазоныSSCC</name>
  <resources>
    <name>FSRAR_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЦифраРасширенияС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифраРасширенияПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДиапазона</name>
    <type>
      <types>EnumRef.итWMSВидыДиапазонвSSCC</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMSДиапазоныSSCC/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение) 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
для Каждого стр из ЭтотОбъект цикл
ТекстСообщения="";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSДиапазоныSSCC.Филиал,
		|	итWMSДиапазоныSSCC.ВидДиапазона,
		|	итWMSДиапазоныSSCC.ДиапазонС,
		|	итWMSДиапазоныSSCC.ДиапазонПо
		|ИЗ
		|	РегистрСведений.итWMSДиапазоныSSCC КАК итWMSДиапазоныSSCC
		|ГДЕ
		|	(итWMSДиапазоныSSCC.ДиапазонС МЕЖДУ &ДиапазонС И &ДиапазаонПО
		|			ИЛИ итWMSДиапазоныSSCC.ДиапазонПо МЕЖДУ &ДиапазонС И &ДиапазаонПО)";
	
	Запрос.УстановитьПараметр("ДиапазаонПО", стр.ДиапазонПо);
	Запрос.УстановитьПараметр("ДиапазонС", стр.ДиапазонС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Отказ=Истина;
	ТекстСообщения="
	| Пересичение диапазонов с Филал:"+Строка(ВыборкаДетальныеЗаписи.Филиал)+" ВидДиапазона:"+Строка(ВыборкаДетальныеЗаписи.ВидДиапазона)+" ДиапазонС-"
	+ВыборкаДетальныеЗаписи.ДиапазонС+" ДиапазонПо-"+ВыборкаДетальныеЗаписи.ДиапазонПо; 
	КонецЦикла;
	Если Отказ=Истина тогда
		Сообщить(ТекстСообщения);
		Возврат
	КонецЕсли;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	//для Каждого стр из ЭтотОбъект цикл
		СтрокаС=Строка(стр.ДиапазонС);
		Если СтрДлина(СтрокаС)<9 тогда
			пока СтрДлина(СтрокаС)<9 цикл
				СтрокаС="0"+СтрокаС;
			КонецЦикла;
		КонецЕсли;
		СтрокаПо=Строка(стр.ДиапазонПо);
		Если СтрДлина(СтрокаПо)<9  тогда
			Пока  СтрДлина(СтрокаПо)<9 цикл
				СтрокаПо="0"+СтрокаПо;
			КонецЦикла;
		КонецЕсли;
		 стр.ЦифраРасширенияС=Число(Лев(СтрокаС,1));
		 стр.ЦифраРасширенияПо=Число(Лев(СтрокаПо,1));
		 
		//стр.ДиапазонСПредставление=Число(Строка(стр.ДиапазонС)+"0000000");
		//Если стр.ДиапазонПо = 0 тогда
		//стр.ДиапазонПоПредставление=0;
		//иначе
		//стр.ДиапазонПоПредставление=Число(Строка(стр.ДиапазонПо)+"9999999");
		
	КонецЦикла;
КонецПроцедуры
